/* <1,2장>
 * 교재 4p : 실행과정
 * 5p : 자바의 장점
 * 14p : 바이트 코드 (.java => javac => .class) 바이트코드
 * 								동일한 코드 => 운영체제의 호환
 * 								=> 배포
 * 28p : main() 설명
 * 29p : 주석 처리 방법
 * 30p : ;에 대한 설명
 * 36p : 변수의 개념
 * 41p : 정수에 대한 설명/크기
 * 43p : 정수 표현법 => 10진법, 2진법(0b), 8진법(0), 16진법(0x)
 * 45p : 문자 => '한개문자'
 * 47p : 실수에 대한 설명
 * 50p : 논리(boolean)
 * 51p : 문자열 String => 52p 특수문자 참조
 * 55p : 자동 형변환 
 * 57p : 강제 형변환
 * 66p : String을 각 데이터형으로 변경
 * 72p : Scanner 설명
 * 
 * <3장>
 * 81p : 증감연산자
 * 83p : 산술연산자
 * 90p : 비교연산자
 * 93p : 논리연산자
 * 104p : 대입연산자
 * 105p : 삼항연산자 
 * 
 * + ppt 복습자료
 * 
 * */

public class 정리_5 {

	public static void main(String[] args) {
		// TODO Auto-generated method stub

	}

}
